snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSW
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSW(void)
{
    /* Write to GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* Write to GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* Write to PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);

    gpio_pin_config_t INTERUPT_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 64)  */
    GPIO_PinInit(BOARD_INITSW_INTERUPT_SENSOR_GPIO, BOARD_INITSW_INTERUPT_SENSOR_PIN, &INTERUPT_SENSOR_config);

    gpio_pin_config_t SW_3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 1)  */
    GPIO_PinInit(BOARD_INITSW_SW_3_GPIO, BOARD_INITSW_SW_3_PIN, &SW_3_config);

    gpio_pin_config_t LED_SWITCH_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin 15)  */
    GPIO_PinInit(BOARD_INITSW_LED_SWITCH_GPIO, BOARD_INITSW_LED_SWITCH_PIN, &LED_SWITCH_config);

    gpio_pin_config_t TASTER_B_R_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_2 (pin 16)  */
    GPIO_PinInit(BOARD_INITSW_TASTER_B_R_GPIO, BOARD_INITSW_TASTER_B_R_PIN, &TASTER_B_R_config);

    gpio_pin_config_t TASTER_T_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_6 (pin 20)  */
    GPIO_PinInit(BOARD_INITSW_TASTER_T_L_GPIO, BOARD_INITSW_TASTER_T_L_PIN, &TASTER_T_L_config);

    gpio_pin_config_t TASTER_B_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_13 (pin 23)  */
    GPIO_PinInit(BOARD_INITSW_TASTER_B_L_GPIO, BOARD_INITSW_TASTER_B_L_PIN, &TASTER_B_L_config);

    gpio_pin_config_t TASTER_T_R_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_16 (pin 24)  */
    GPIO_PinInit(BOARD_INITSW_TASTER_T_R_GPIO, BOARD_INITSW_TASTER_T_R_PIN, &TASTER_T_R_config);

    /* Interrupt configuration on GPIO1_6 (pin 64): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_INTERUPT_SENSOR_GPIO, BOARD_INITSW_INTERUPT_SENSOR_PIN, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIO1_7 (pin 1): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_SW_3_GPIO, BOARD_INITSW_SW_3_PIN, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIO2_13 (pin 23): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_TASTER_B_L_GPIO, BOARD_INITSW_TASTER_B_L_PIN, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIO2_16 (pin 24): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_TASTER_T_R_GPIO, BOARD_INITSW_TASTER_T_R_PIN, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIO2_2 (pin 16): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_TASTER_B_R_GPIO, BOARD_INITSW_TASTER_B_R_PIN, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIO2_6 (pin 20): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITSW_TASTER_T_L_GPIO, BOARD_INITSW_TASTER_T_L_PIN, kGPIO_InterruptFallingEdge);

    /* PORT1_6 (pin 64) is configured as P1_6 */
    PORT_SetPinMux(BOARD_INITSW_INTERUPT_SENSOR_PORT, BOARD_INITSW_INTERUPT_SENSOR_PIN, kPORT_MuxAlt0);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                     /* Pull Select: Enables internal pullup resistor. */
                     | PORT_PCR_PS(PCR_PS_ps1)

                     /* Pull Enable: Enables. */
                     | PORT_PCR_PE(PCR_PE_pe1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_7 (pin 1) is configured as P1_7 */
    PORT_SetPinMux(BOARD_INITSW_SW_3_PORT, BOARD_INITSW_SW_3_PIN, kPORT_MuxAlt0);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[1] = ((PORT2->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_1 (pin 15) is configured as P2_1. */
                     | PORT_PCR_MUX(PORT2_PCR1_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[13] = ((PORT2->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

