snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void)
{
    /* Write to GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* Write to GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* Write to GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* Write to PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* Write to PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* FLEXPWM0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXPWM0_RST_SHIFT_RSTn);

    gpio_pin_config_t DIR_white_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_12 (pin 6)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_white_GPIO, BOARD_INITPWM_DIR_white_PIN, &DIR_white_config);

    gpio_pin_config_t DIR_yellow_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin 7)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_yellow_GPIO, BOARD_INITPWM_DIR_yellow_PIN, &DIR_yellow_config);

    gpio_pin_config_t DIR_green_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin 14)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_green_GPIO, BOARD_INITPWM_DIR_green_PIN, &DIR_green_config);

    gpio_pin_config_t EN_WHITE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin 17)  */
    GPIO_PinInit(BOARD_INITPWM_EN_WHITE_GPIO, BOARD_INITPWM_EN_WHITE_PIN, &EN_WHITE_config);

    gpio_pin_config_t EN_YELLOW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_4 (pin 18)  */
    GPIO_PinInit(BOARD_INITPWM_EN_YELLOW_GPIO, BOARD_INITPWM_EN_YELLOW_PIN, &EN_YELLOW_config);

    gpio_pin_config_t EN_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin 19)  */
    GPIO_PinInit(BOARD_INITPWM_EN_RED_GPIO, BOARD_INITPWM_EN_RED_PIN, &EN_RED_config);

    gpio_pin_config_t MOTOR_ALL_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin 21)  */
    GPIO_PinInit(BOARD_INITPWM_MOTOR_ALL_EN_GPIO, BOARD_INITPWM_MOTOR_ALL_EN_PIN, &MOTOR_ALL_EN_config);

    gpio_pin_config_t EN_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_1 (pin 45)  */
    GPIO_PinInit(BOARD_INITPWM_EN_GREEN_GPIO, BOARD_INITPWM_EN_GREEN_PIN, &EN_GREEN_config);

    gpio_pin_config_t NULL_TRIGGER_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_8 (pin 42)  */
    GPIO_PinInit(BOARD_INITPWM_NULL_TRIGGER_GPIO, BOARD_INITPWM_NULL_TRIGGER_PIN, &NULL_TRIGGER_config);

    gpio_pin_config_t EN_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin 36)  */
    GPIO_PinInit(BOARD_INITPWM_EN_BLUE_GPIO, BOARD_INITPWM_EN_BLUE_PIN, &EN_BLUE_config);

    gpio_pin_config_t EN_ORANGE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 35)  */
    GPIO_PinInit(BOARD_INITPWM_EN_ORANGE_GPIO, BOARD_INITPWM_EN_ORANGE_PIN, &EN_ORANGE_config);

    gpio_pin_config_t DIR_orange_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_29 (pin 32)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_orange_GPIO, BOARD_INITPWM_DIR_orange_PIN, &DIR_orange_config);

    gpio_pin_config_t DIR_blue_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_30 (pin 31)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_blue_GPIO, BOARD_INITPWM_DIR_blue_PIN, &DIR_blue_config);

    gpio_pin_config_t DIR_red_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_31 (pin 30)  */
    GPIO_PinInit(BOARD_INITPWM_DIR_red_GPIO, BOARD_INITPWM_DIR_red_PIN, &DIR_red_config);

    /* Interrupt configuration on GPIO3_8 (pin 42): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPWM_NULL_TRIGGER_GPIO, BOARD_INITPWM_NULL_TRIGGER_PIN, kGPIO_InterruptFallingEdge);

    const port_pin_config_t DIR_white = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         kPORT_NormalDriveStrength,
                                         /* Pin is configured as P1_12 */
                                         kPORT_MuxAlt0,
                                         /* Digital input enabled */
                                         kPORT_InputBufferEnable,
                                         /* Digital input is not inverted */
                                         kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORT1_12 (pin 6) is configured as P1_12 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_white_PORT, BOARD_INITPWM_DIR_white_PIN, &DIR_white);

    const port_pin_config_t DIR_yellow = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          kPORT_NormalDriveStrength,
                                          /* Pin is configured as P1_13 */
                                          kPORT_MuxAlt0,
                                          /* Digital input enabled */
                                          kPORT_InputBufferEnable,
                                          /* Digital input is not inverted */
                                          kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORT1_13 (pin 7) is configured as P1_13 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_yellow_PORT, BOARD_INITPWM_DIR_yellow_PIN, &DIR_yellow);

    const port_pin_config_t DIR_green = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         kPORT_NormalDriveStrength,
                                         /* Pin is configured as P2_0 */
                                         kPORT_MuxAlt0,
                                         /* Digital input enabled */
                                         kPORT_InputBufferEnable,
                                         /* Digital input is not inverted */
                                         kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORT2_0 (pin 14) is configured as P2_0 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_green_PORT, BOARD_INITPWM_DIR_green_PIN, &DIR_green);

    const port_pin_config_t EN_WHITE = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        kPORT_NormalDriveStrength,
                                        /* Pin is configured as P2_3 */
                                        kPORT_MuxAlt0,
                                        /* Digital input enabled */
                                        kPORT_InputBufferEnable,
                                        /* Digital input is not inverted */
                                        kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORT2_3 (pin 17) is configured as P2_3 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_WHITE_PORT, BOARD_INITPWM_EN_WHITE_PIN, &EN_WHITE);

    const port_pin_config_t EN_YELLOW = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         kPORT_NormalDriveStrength,
                                         /* Pin is configured as P2_4 */
                                         kPORT_MuxAlt0,
                                         /* Digital input enabled */
                                         kPORT_InputBufferEnable,
                                         /* Digital input is not inverted */
                                         kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORT2_4 (pin 18) is configured as P2_4 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_YELLOW_PORT, BOARD_INITPWM_EN_YELLOW_PIN, &EN_YELLOW);

