snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.c
    const port_pin_config_t EN_RED = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      kPORT_NormalDriveStrength,
                                      /* Pin is configured as P2_5 */
                                      kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      kPORT_UnlockRegister};
    /* PORT2_5 (pin 19) is configured as P2_5 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_RED_PORT, BOARD_INITPWM_EN_RED_PIN, &EN_RED);

    const port_pin_config_t MOTOR_ALL_EN = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Low internal pull resistor value is selected. */
                                            kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            kPORT_NormalDriveStrength,
                                            /* Pin is configured as P2_7 */
                                            kPORT_MuxAlt0,
                                            /* Digital input enabled */
                                            kPORT_InputBufferEnable,
                                            /* Digital input is not inverted */
                                            kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORT2_7 (pin 21) is configured as P2_7 */
    PORT_SetPinConfig(BOARD_INITPWM_MOTOR_ALL_EN_PORT, BOARD_INITPWM_MOTOR_ALL_EN_PIN, &MOTOR_ALL_EN);

    const port_pin_config_t EN_GREEN = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        kPORT_NormalDriveStrength,
                                        /* Pin is configured as P3_1 */
                                        kPORT_MuxAlt0,
                                        /* Digital input enabled */
                                        kPORT_InputBufferEnable,
                                        /* Digital input is not inverted */
                                        kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORT3_1 (pin 45) is configured as P3_1 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_GREEN_PORT, BOARD_INITPWM_EN_GREEN_PIN, &EN_GREEN);

    const port_pin_config_t EN_BLUE = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       kPORT_NormalDriveStrength,
                                       /* Pin is configured as P3_14 */
                                       kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORT3_14 (pin 36) is configured as P3_14 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_BLUE_PORT, BOARD_INITPWM_EN_BLUE_PIN, &EN_BLUE);

