snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.c
    const port_pin_config_t EN_ORANGE = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         kPORT_NormalDriveStrength,
                                         /* Pin is configured as P3_15 */
                                         kPORT_MuxAlt0,
                                         /* Digital input enabled */
                                         kPORT_InputBufferEnable,
                                         /* Digital input is not inverted */
                                         kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORT3_15 (pin 35) is configured as P3_15 */
    PORT_SetPinConfig(BOARD_INITPWM_EN_ORANGE_PORT, BOARD_INITPWM_EN_ORANGE_PIN, &EN_ORANGE);

    const port_pin_config_t DIR_orange = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          kPORT_NormalDriveStrength,
                                          /* Pin is configured as P3_29 */
                                          kPORT_MuxAlt0,
                                          /* Digital input enabled */
                                          kPORT_InputBufferEnable,
                                          /* Digital input is not inverted */
                                          kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORT3_29 (pin 32) is configured as P3_29 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_orange_PORT, BOARD_INITPWM_DIR_orange_PIN, &DIR_orange);

    const port_pin_config_t DIR_blue = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        kPORT_NormalDriveStrength,
                                        /* Pin is configured as P3_30 */
                                        kPORT_MuxAlt0,
                                        /* Digital input enabled */
                                        kPORT_InputBufferEnable,
                                        /* Digital input is not inverted */
                                        kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORT3_30 (pin 31) is configured as P3_30 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_blue_PORT, BOARD_INITPWM_DIR_blue_PIN, &DIR_blue);

    const port_pin_config_t DIR_red = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       kPORT_NormalDriveStrength,
                                       /* Pin is configured as P3_31 */
                                       kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORT3_31 (pin 30) is configured as P3_31 */
    PORT_SetPinConfig(BOARD_INITPWM_DIR_red_PORT, BOARD_INITPWM_DIR_red_PIN, &DIR_red);

    const port_pin_config_t PWM_ALL = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       kPORT_NormalDriveStrength,
                                       /* Pin is configured as PWM0_A0 */
                                       kPORT_MuxAlt5,
                                       /* Digital input enabled */
                                       kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORT3_6 (pin 44) is configured as PWM0_A0 */
    PORT_SetPinConfig(BOARD_INITPWM_PWM_ALL_PORT, BOARD_INITPWM_PWM_ALL_PIN, &PWM_ALL);

    const port_pin_config_t NULL_TRIGGER = {/* Internal pull-up resistor is enabled */
                                            kPORT_PullUp,
                                            /* Low internal pull resistor value is selected. */
                                            kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            kPORT_NormalDriveStrength,
                                            /* Pin is configured as P3_8 */
                                            kPORT_MuxAlt0,
                                            /* Digital input enabled */
                                            kPORT_InputBufferEnable,
                                            /* Digital input is not inverted */
                                            kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORT3_8 (pin 42) is configured as P3_8 */
    PORT_SetPinConfig(BOARD_INITPWM_NULL_TRIGGER_PORT, BOARD_INITPWM_NULL_TRIGGER_PIN, &NULL_TRIGGER);

